app/controllers/api/bookings_controller.rb

    def create
      @booking = Booking.new(booking_params)
      if @booking.save
---
INSERT INTO "bookings" ("site_id", "guest_id", "guest_num", "created_at", "updated_at", "check_in", "check_out") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def destroy
      @booking = Booking.find(params[:id])
      @booking.destroy
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 27]]