app/controllers/api/reviews_controller.rb

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def index
        if params[:site_id]
            @reviews = Site.find(params[:site_id]).reviews