app/controllers/api/sites_controller.rb

SELECT "sites".* FROM "sites" WHERE (lat < '40.751626') AND (lat < '40.751626') AND (lat < NULL) AND (lat < NULL)
---
    def index
        @sites =  bounds ? Site.in_bounds(bounds) : Site.all

SELECT "photos".* FROM "photos" WHERE "photos"."site_id" = $1  [["site_id", 218]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @site = Site.with_attached_photos.find(params[:id])