app/views/api/sites/show.json.jbuilder

SELECT "photos".* FROM "photos" WHERE "photos"."site_id" = $1  [["site_id", 218]]
---

@site.photos.each do |photo|