app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "q-598vs5y6bVxXXSWmFyZQ"], ["LIMIT", 1]]
---
  def generate_session_token
    self.session_token =  SecureRandom.urlsafe_base64
    while User.find_by(session_token: self.session_token)